Бух_тест/src/Documents/РегистрацияВходящегоНалоговогоДокумента/РегистрацияВходящегоНалоговогоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияВходящегоНалоговогоДокумента</name>
  <comment>(Регл)</comment>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ВозвратТоваровПоставщику</basedOn>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <basedOn>Document.ОтчетКомиссионераОПродажах</basedOn>
  <basedOn>Document.ПоступлениеДопРасходов</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.РасходныйКассовыйОрдер</basedOn>
  <basedOn>Document.ПоступлениеНаРасчетныйСчет</basedOn>
  <basedOn>Document.СписаниеСРасчетногоСчета</basedOn>
  <basedOn>Document.ОтчетКомитентуОПродажах</basedOn>
  <basedOn>Document.ПоступлениеНМА</basedOn>
  <basedOn>Document.СчетНаОплатуПоставщика</basedOn>
  <basedOn>Document.ПоступлениеИзПереработки</basedOn>
  <basedOn>Document.КорректировкаОжидаемогоИПодтвержденногоНДС</basedOn>
  <basedOn>Document.ИзменениеНалоговогоНазначенияЗапасов</basedOn>
  <basedOn>Document.ИзменениеНалоговогоНазначенияТЗР</basedOn>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПродаж</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.НДСНалоговыйКредит</registerRecords>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПриобретений</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <comment>Вид операции</comment>
    <type>
      <types>EnumRef.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ) </comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ) </comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <comment>Номер документа сторонней организации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>Дата документа сторонней организации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма документа без НДС (в гривнях)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <comment>(Общ) Сумма НДС документа (в гривнях)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетНДС</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт1</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт2</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт3</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВексель</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВексельСубконто1</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВексельСубконто2</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВексельСубконто3</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозвратнойТары</name>
    <comment>Сумма возвратной тары (в гривнях)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНДС</name>
    <comment>(Регл) </comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректируемогоВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКорректируемогоВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключаетсяВУточняющийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецРежимНалогообложения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточняемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКорректировкиНДСКредит</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеКорректировки</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетПроверкиВключенияВЕдиныйРеестрНалоговыхНакладных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВключенияВЕдиныйРеестрНалоговыхНакладных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВПриложение8Декларации</name>
    <comment>0 - не включать; 1 - включать в таблицу 1; 2 - включать в таблицу 2</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНарушенияПриложение8Декларации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыДокОтказаПриложение8Декларации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПриложение8Декларации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма7Приложение8Декларации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСПриложение8Декларации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС7Приложение8Декларации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеXML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Звит1С_DOC_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетНДСУсловнаяПродажа</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>НаименованиеТовара</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ) Цена продажи без НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ) Сумм без НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ) Сумма НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДляХозяйственнойДеятельности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДляОперацийОблагаемыхНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДекларацииНДСНалоговыйКредит</name>
      <type>
        <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
      </type>
    </attributes>
    <attributes>
      <name>Амортизируется</name>
      <comment>Поставка Основных фондов. Исользуется для запонения Приложения 5 к Декларации по НДС (с 2008 г)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропорциональныйНДС</name>
      <comment>ст. 199 НК</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Бух_тест/src/Documents/РегистрацияВходящегоНалоговогоДокумента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем мВалютаРегламентированногоУчета;

// В случае, когда документ-основание является документом оплаты или Авансовым отчетом (то есть документом,
// в которм могут быть указаны несколько Договоров/сделок) - возвращает один из договоров/сделку. Выбор производится либо
// автоматически, либо (при работе на Клиенте и если договоров несколько) интерактивно пользователем.
// Параметры
//   Основание - Документ основание
// Возвращаемое значение:
//  Структура 
//		<СправочникСсылка.ДоговорыКонтрагентов>   – выбранный/определенный договор
//		<ДокументСсылка>   						  – выбранная сделка
//
Функция ОпределитьДоговорСделку(Основание) 
	
	Перем ТабДоговора, ПредпочтительныйДоговорСделка;
	
	ПустойДоговорСделка = Новый Структура("ДоговорКонтрагента,Сделка");
	
	Если Основание = Неопределено Тогда
		
		Возврат ПустойДоговорСделка;
		
	КонецЕсли;	
	
	МетаданныеДокумента = Основание.Метаданные();
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		                |	АвансовыйОтчетВозвратнаяТара.ДоговорКонтрагента,
		                |	АвансовыйОтчетВозвратнаяТара.Контрагент КАК Контрагент,
						|	АвансовыйОтчетВозвратнаяТара.Сделка КАК Сделка
		                |ИЗ
		                |	Документ.АвансовыйОтчет.ВозвратнаяТара КАК АвансовыйОтчетВозвратнаяТара
		                |ГДЕ
		                |	 АвансовыйОтчетВозвратнаяТара.Ссылка = &Ссылка
		                |	 И НЕ АвансовыйОтчетВозвратнаяТара.ДоговорКонтрагента = &ПустойДоговор
		                |
		                |ОБЪЕДИНИТЬ
		                |
		                |ВЫБРАТЬ
		                |	АвансовыйОтчетОплатаПоставщикам.ДоговорКонтрагента,
		                |	АвансовыйОтчетОплатаПоставщикам.Контрагент,
						|	АвансовыйОтчетОплатаПоставщикам.Сделка
		                |ИЗ
		                |	Документ.АвансовыйОтчет.ОплатаПоставщикам КАК АвансовыйОтчетОплатаПоставщикам
		                |ГДЕ
		                |	АвансовыйОтчетОплатаПоставщикам.Ссылка = &Ссылка
		                |	И НЕ АвансовыйОтчетОплатаПоставщикам.ДоговорКонтрагента = &ПустойДоговор
		                |
		                |ОБЪЕДИНИТЬ
		                |
		                |ВЫБРАТЬ
		                |	АвансовыйОтчетПрочее.ДоговорКонтрагента,
		                |	АвансовыйОтчетПрочее.Контрагент,
						|	АвансовыйОтчетПрочее.Сделка
		                |ИЗ
		                |	Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчетПрочее
		                |ГДЕ
		                |	АвансовыйОтчетПрочее.Ссылка = &Ссылка
		                |	И НЕ АвансовыйОтчетПрочее.ДоговорКонтрагента = &ПустойДоговор
		                |
		                |ОБЪЕДИНИТЬ
		                |
		                |ВЫБРАТЬ
		                |	АвансовыйОтчетТовары.ДоговорКонтрагента,
		                |	АвансовыйОтчетТовары.Контрагент,
						|	АвансовыйОтчетТовары.Сделка
		                |ИЗ
		                |	Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
		                |ГДЕ
		                |	 АвансовыйОтчетТовары.Ссылка = &Ссылка
		                |	 И НЕ АвансовыйОтчетТовары.ДоговорКонтрагента = &ПустойДоговор
		                |
		                |ОБЪЕДИНИТЬ
		                |
		                |ВЫБРАТЬ
		                |	РегистрНДС.ДоговорКонтрагента,
		                |	РегистрНДС.ДоговорКонтрагента.Владелец,
						|	РегистрНДС.Сделка
		                |ИЗ
		                |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК РегистрНДС
		                |ГДЕ
		                |	    РегистрНДС.Регистратор = &Ссылка
						|  И НЕ РегистрНДС.ДоговорКонтрагента.СложныйНалоговыйУчет
						|";
						
		Запрос.УстановитьПараметр("Ссылка", Основание);
		Запрос.УстановитьПараметр("ПустойДоговор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		ТабДоговора = Запрос.Выполнить().Выгрузить();
		
		Если ТабДоговора.Количество() = 0 Тогда
			
			Возврат ПустойДоговорСделка;
			
		КонецЕсли;
		
		// первый указанный в документе договор
		ПредпочтительныйДоговорСделка = Новый Структура("ДоговорКонтрагента, Сделка", ТабДоговора[0].ДоговорКонтрагента, ТабДоговора[0].Сделка);
		
		ТабДоговора.Свернуть("Контрагент, ДоговорКонтрагента, Сделка", "");
		ТабДоговора.Сортировать("Контрагент, ДоговорКонтрагента, Сделка");
		ТабДоговора.Колонки.ДоговорКонтрагента.Заголовок = "Договор";
		ТабДоговора.Колонки.ДоговорКонтрагента.Ширина = 20;
		ТабДоговора.Колонки.Контрагент.Ширина = 10;
		ТабДоговора.Колонки.Сделка.Ширина = 30;
		
	ИначеЕсли ОбщегоНазначенияБП.ЕстьТабЧастьДокумента("РасшифровкаПлатежа", МетаданныеДокумента) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		                |	ПлатежныйДокумент.ДоговорКонтрагента,
						|	ПлатежныйДокумент.Сделка
		                |ИЗ
		                |	Документ."+ МетаданныеДокумента.Имя +".РасшифровкаПлатежа КАК ПлатежныйДокумент
		                |ГДЕ
		                |	ПлатежныйДокумент.Ссылка = &Ссылка
						|
						|ОБЪЕДИНИТЬ 
						|
						|ВЫБРАТЬ
		                |	РегистрНДС.ДоговорКонтрагента,
						|	РегистрНДС.Сделка
		                |ИЗ
		                |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК РегистрНДС
		                |ГДЕ
		                |	    РегистрНДС.Регистратор = &Ссылка
						|  И НЕ РегистрНДС.ДоговорКонтрагента.СложныйНалоговыйУчет";
						
		Запрос.УстановитьПараметр("Ссылка", Основание);
		ТабДоговора = Запрос.Выполнить().Выгрузить();
		
		Если ТабДоговора.Количество() = 0 Тогда
			
			Возврат ПустойДоговорСделка;
			
		КонецЕсли;
		
		// первый указанный в документе договор
		ПредпочтительныйДоговорСделка = Новый Структура("ДоговорКонтрагента, Сделка", ТабДоговора[0].ДоговорКонтрагента, ТабДоговора[0].Сделка);
		
		ТабДоговора.Свернуть("ДоговорКонтрагента,Сделка", "");		
		ТабДоговора.Сортировать("ДоговорКонтрагента,Сделка");		
		ТабДоговора.Колонки.ДоговорКонтрагента.Заголовок = "Договор";
		ТабДоговора.Колонки.ДоговорКонтрагента.Ширина = 30;
		ТабДоговора.Колонки.Сделка.Ширина = 30;
		
	ИначеЕсли ОбщегоНазначенияБП.ЕстьТабЧастьДокумента("СуммыДолга", МетаданныеДокумента) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		                |	КорректировкаДолга.ДоговорКонтрагента,
						|	КорректировкаДолга.Сделка
		                |ИЗ
		                |	Документ."+ МетаданныеДокумента.Имя +".СуммыДолга КАК КорректировкаДолга
		                |ГДЕ
		                |	КорректировкаДолга.Ссылка = &Ссылка
						|
						|ОБЪЕДИНИТЬ 
						|
						|ВЫБРАТЬ
		                |	РегистрНДС.ДоговорКонтрагента,
						|	РегистрНДС.Сделка
		                |ИЗ
		                |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК РегистрНДС
		                |ГДЕ
		                |	    РегистрНДС.Регистратор = &Ссылка
						|  И НЕ РегистрНДС.ДоговорКонтрагента.СложныйНалоговыйУчет";
						
		Запрос.УстановитьПараметр("Ссылка", Основание);
		ТабДоговора = Запрос.Выполнить().Выгрузить();
		
		Если ТабДоговора.Количество() = 0 Тогда
			
			Возврат ПустойДоговорСделка;
			
		КонецЕсли;
		
		// первый указанный в документе договор
		ПредпочтительныйДоговорСделка = Новый Структура("ДоговорКонтрагента, Сделка", ТабДоговора[0].ДоговорКонтрагента, ТабДоговора[0].Сделка);
		
		ТабДоговора.Свернуть("ДоговорКонтрагента,Сделка", "");		
		ТабДоговора.Сортировать("ДоговорКонтрагента,Сделка");		
		ТабДоговора.Колонки.ДоговорКонтрагента.Заголовок = "Договор";
		ТабДоговора.Колонки.ДоговорКонтрагента.Ширина = 30;
		ТабДоговора.Колонки.Сделка.Ширина = 30;
		
	
	ИначеЕсли ОбщегоНазначенияБП.ЕстьРеквизитДокумента("ДоговорКонтрагента",  МетаданныеДокумента) Тогда
		
		ПредпочтительныйДоговорСделка = Новый Структура("ДоговорКонтрагента, Сделка", Основание.ДоговорКонтрагента, Неопределено);
		
		Если  Основание.ДоговорКонтрагента.ВедениеВзаиморасчетовНУ = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам
			И ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			
			// сам документ и будет сделкой
			ПредпочтительныйДоговорСделка.Вставить("Сделка", Основание);	
			
			Возврат ПредпочтительныйДоговорСделка;

		ИначеЕсли ОбщегоНазначенияБП.ЕстьРеквизитДокумента("Сделка",  			  МетаданныеДокумента)
			  ИЛИ ОбщегоНазначенияБП.ЕстьРеквизитДокумента("СделкаПоПриобретению",  МетаданныеДокумента) Тогда
			  
			ИмяРеквизитаСделка = ?(ОбщегоНазначенияБП.ЕстьРеквизитДокумента("СделкаПоПриобретению",  МетаданныеДокумента), 
								   "СделкаПоПриобретению", 
								   "Сделка");
			  
			Если Основание.ДоговорКонтрагента.ВедениеВзаиморасчетовНУ = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам Тогда
				  
				  ПредпочтительныйДоговорСделка.Вставить("Сделка",  Основание[ИмяРеквизитаСделка]);		
				  
				  Если Основание.Проведен Тогда
						Запрос = Новый Запрос();
						Запрос.Текст = "ВЫБРАТЬ
						                |	РегистрНДС.ДоговорКонтрагента,
										|	РегистрНДС.Сделка
						                |ИЗ
						                |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК РегистрНДС
						                |ГДЕ
						                |	РегистрНДС.Регистратор = &Ссылка";
										
						Запрос.УстановитьПараметр("Ссылка", Основание);
						ТабДоговора = Запрос.Выполнить().Выгрузить();
						
						Если ТабДоговора.Количество() = 0 Тогда
							// это очень странно
							Возврат ПредпочтительныйДоговорСделка;
							
						КонецЕсли;
						
						// первый указанный в документе договор
						ПредпочтительныйДоговорСделка = Новый Структура("ДоговорКонтрагента, Сделка", ТабДоговора[0].ДоговорКонтрагента, ТабДоговора[0].Сделка);
						
						ТабДоговора.Свернуть("ДоговорКонтрагента,Сделка", "");		
						ТабДоговора.Сортировать("ДоговорКонтрагента,Сделка");		
						ТабДоговора.Колонки.ДоговорКонтрагента.Заголовок = "Договор";
						ТабДоговора.Колонки.ДоговорКонтрагента.Ширина = 60;
						ТабДоговора.Колонки.Сделка.Ширина = 30;
					  
				  КонецЕсли;
			Иначе	  
				
				Возврат ПредпочтительныйДоговорСделка;
			
			КонецЕсли;
			
		Иначе
			
			Возврат ПредпочтительныйДоговорСделка;
			
		КонецЕсли;
				
	Иначе
		
		Возврат ПустойДоговорСделка;	
		
	КонецЕсли; 

	Возврат  ПредпочтительныйДоговорСделка;
	
КонецФункции // ОпределитьДоговорСделку()

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА


// Процедура определяет параметры регл. учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"                        , УчетнаяПолитика.ПлательщикНДС(СтруктураШапкиДокумента.Организация, КонецМесяца(СтруктураШапкиДокумента.Дата)));
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитикиРегл()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, МассивНепроверяемыхРеквизитов)
	
	Если  НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
		СтрокаСообщения = НСтр("ru='Фирма не является плательщиком НДС!';uk='Фірма не є платником ПДВ!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, ЭтотОбъект,"Организация",, Отказ);	
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ПогашениеНалоговогоВекселя Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаНДС");	
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаВексель");		
	КонецЕсли;
	
	Если Дата < '2015-07-01' Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетНДСУсловнаяПродажа");	
	КонецЕсли;
	
	Если НЕ	 ((ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат) 
		      ИЛИ (ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка))	
		 ИЛИ (Дата < '2015-07-01')Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаКорректируемогоВходящегоДокумента");		 
	КонецЕсли;
	
	
	Если НЕ СтруктураШапкиДокумента.ВедениеВзаиморасчетовНУ = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Сделка");	
	КонецЕсли;

	Если НЕ ВключаетсяВУточняющийРасчет Тогда
		МассивНепроверяемыхРеквизитов.Добавить("УточняемыйПериод");
	КонецЕсли;
	
	Если    ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Сделка");
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаНДС");
	Иначе	
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаКорректировкиНДСКредит");
	КонецЕсли;

	Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита 
		И НЕ (СуммаДокумента = 0 И СуммаНДСДокумента = 0) Тогда
	
		СтрокаСообщения = НСтр("ru='Для данного вида операции сумма документа и сумма НДС должна быть нулевой!';uk='Для даного виду операції сума документа та ПДВ повинна дорівнювати нулю!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, ЭтотОбъект,"ВидОперации",, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();
	
	ТаблицаТоваров.Колонки.Добавить("ПроводкиСуммаНДС",     ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("ВидДеятельностиНДС",   Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДеятельностиНДС"));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСВал",     		ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаВал",     		ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСПропорционально", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСУсловнойПродажи", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15,2));
	
	Для каждого СтрокаТаблицы из ТаблицаТоваров Цикл
		
		// движения по регистру ОжидаемыйИПодтвержденныйНДСПриобретений могут быть только от резидентов
		// и только в гривне.
		СтрокаТаблицы.СуммаНДСВал = СтрокаТаблицы.СуммаНДС;
		СтрокаТаблицы.СуммаВал 	  = СтрокаТаблицы.Сумма;
		
		// Сумма налогового кредита 
		СтрокаТаблицы.ПроводкиСуммаНДС = СтрокаТаблицы.СуммаНДС;
		// Обнулим эту сумму, если отсутствует право на налоговый кредит	
		Если  НЕ (СтрокаТаблицы.ДляХозяйственнойДеятельности И СтрокаТаблицы.ДляОперацийОблагаемыхНДС) Тогда
			СтрокаТаблицы.ПроводкиСуммаНДС = 0;
		КонецЕсли;
		
		Если СтрокаТаблицы.ПропорциональныйНДС Тогда
		    СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая;	
			Если СтрокаТаблицы.ДляОперацийОблагаемыхНДС Тогда
				СтрокаТаблицы.СуммаНДСПропорционально =  СтрокаТаблицы.СуммаНДСВал
			КонецЕсли;
		ИначеЕсли СтрокаТаблицы.ДляОперацийОблагаемыхНДС Тогда
			СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Облагаемая;	
		Иначе	
			СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая;				
		КонецЕсли;
		
		// с 2015 года, если дата документ и дата вх. нал. документа после 07.2015 - на налоговый кредит относятся все суммы вх. НДС, однако
		// если приобретение осуществляется для не облагаемых/не хоз. операций, необходимо оформить условную продажу
		Если Дата >= '2015-07-01' Тогда
			
			Если СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая Тогда
			
				СтрокаТаблицы.СуммаНДСУсловнойПродажи = СтрокаТаблицы.СуммаНДС;	
				
			ИначеЕсли  СтрокаТаблицы.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая 
				     И НЕ СтрокаТаблицы.ДляОперацийОблагаемыхНДС Тогда
					 
				СтрокаТаблицы.СуммаНДСУсловнойПродажи = СтрокаТаблицы.СуммаНДС;	
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(СтруктураШапкиДокумента, Отказ, МассивНепроверяемыхРеквизитов)
	
	// проверим допустимость указания пропорционального ндс
	Если Не Отказ Тогда
		
		Для каждого Строка Из Товары Цикл
			
			Префикс = "Товары[%1].";
			Префикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Префикс, Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ="));
				
			Если  Строка.ПропорциональныйНДС Тогда
				
				Поле = Префикс + "СтатьяДекларацииНДСНалоговыйКредит";
				Если НЕ Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС20
				   И НЕ Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС7
				   И НЕ Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС0  Тогда
				
					Если    Строка.СтатьяДекларацииНДСНалоговыйКредит = Справочники.СтатьиНалоговыхДеклараций.НДС_НКПропорционально 
						ИЛИ Строка.СтатьяДекларацииНДСНалоговыйКредит.Родитель = Справочники.СтатьиНалоговыхДеклараций.НДС_НКПропорционально Тогда
						
						СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке ""%1"" указан признак пропорционального НДС для ставки НДС отличной от 20%, 7% или 0%! Статья декларации НДС(н/к) в этом случае не должна входить в группу ""%2""!.';uk='У рядку ""%1"" зазначена ознака пропорційного ПДВ для ставки ПДВ яка відмінна від 20%, 7% або 0%! Стаття декларації ПДВ(п/к) в цьому випадку не повинна входити в групу ""%2""!.'"), Строка.НомерСтроки, Справочники.СтатьиНалоговыхДеклараций.НДС_НКПропорционально);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, ЭтотОбъект, Поле, , Отказ);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Поле = Префикс + "ДляХозяйственнойДеятельности";
				Если НЕ Строка.ДляХозяйственнойДеятельности Тогда
					
					СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке ""%1"" указан признак пропорционального НДС! В этом случае должен быть установлен признак использования в хозяйственной деятельности!.';uk='У рядку ""%1"" зазначена ознака пропорційного ПДВ! У цьому випадку повинна бути встановлена ознака використання в господарській діяльності!'"), Строка.НомерСтроки);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, ЭтотОбъект, Поле, , Отказ);
					
				КонецЕсли;			
				
			КонецЕсли;	
			
		КонецЦикла; 
		
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Проводки по бухгалтерскому учету НДС 
	ПроводкиБУ = Движения.Хозрасчетный;

	// ТОВАРЫ
	ТаблицаДвижений = ТаблицаПоТоварам.Скопировать();
	//ТаблицаДвижений.Свернуть("СчетУчетаНДС","ПроводкиСуммаНДС");
	ТаблицаДвижений.Свернуть("СчетУчетаНДС","ПроводкиСуммаНДС,СуммаНДСУсловнойПродажи");

	Корректировка = ((ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат) 
			     ИЛИ (ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка));
	
	СодержаниеПроводки = НСтр("ru='НДС: налоговый кредит: ';uk='ПДВ: податковий кредит: '",Локализация.КодЯзыкаИнформационнойБазы());
	Если 	 ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная Тогда
		СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='налоговая накладная';uk='податкова накладна'",Локализация.КодЯзыкаИнформационнойБазы());
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек Тогда 
		СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='подтверждение (товарный чек)';uk='підтвердження (товарний чек)'",Локализация.КодЯзыкаИнформационнойБазы());
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		СодержаниеПроводки = НСтр("ru='НДС: налоговые обязательства: расчет корректировки (возврат)';uk=""ПДВ: податкові зобов'язання: розрахунок коригування (повернення)""",Локализация.КодЯзыкаИнформационнойБазы());       	
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка Тогда
		СодержаниеПроводки = НСтр("ru='НДС: налоговые обязательства: расчет корректировки (изменение суммы компенсации)';uk=""ПДВ: податкові зобов'язання: розрахунок коригування (зміна суми компенсації)""",Локализация.КодЯзыкаИнформационнойБазы());       
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода Тогда
		СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='работы от нерезидента прошлого периода';uk='роботи від нерезидента минулого періоду'",Локализация.КодЯзыкаИнформационнойБазы());
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.BeксeльПpoшлoгoПepиoдa Тогда		
		СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='вексель, погашенный в прошлом периоде';uk='вексель, погашений у минулому періоді'",Локализация.КодЯзыкаИнформационнойБазы());
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки Тогда		
	    Если СтруктураШапкиДокумента.ВключаетсяВУточняющийРасчет = Ложь Тогда
			СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='исправление ошибки в текущем периоде';uk='виправлення помилки у поточному періоді'");
		Иначе
			СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='корректировка через уточняющий расчет';uk='коригування через уточнюючий розрахункок'");			
		КонецЕсли;
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита Тогда		
	    Если СтруктураШапкиДокумента.ВключаетсяВУточняющийРасчет = Ложь Тогда
			СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='восстановление налогового кредита в текущем периоде';uk='відновлення податкового кредиту поточному періоді'");
		Иначе
			СодержаниеПроводки = СодержаниеПроводки+ НСтр("ru='восстановление налогового кредита через уточняющий расчет';uk='відновлення податкового кредиту через уточнюючий розрахункок'");			
		КонецЕсли;
	КонецЕсли;		
	
	Для Каждого СтрокаТаблицы Из ТаблицаДвижений Цикл
		
		Если    СтрокаТаблицы.ПроводкиСуммаНДС <> 0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период                     = СтруктураШапкиДокумента.Дата;
			Проводка.Активность                 = Истина;
			Проводка.Организация                = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                      = СтрокаТаблицы.ПроводкиСуммаНДС;
			Проводка.Содержание                 = СодержаниеПроводки;
			Проводка.НомерЖурнала               = "";

				
			Если ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ПогашениеНалоговогоВекселя Тогда
					
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетУчетаВексель;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ВексельСубконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ВексельСубконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ВексельСубконто3);

			
				Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетНДС;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СубконтоДт1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СубконтоДт2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СубконтоДт3);
					
			Иначе	
					
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетНДС;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СубконтоДт1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СубконтоДт2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СубконтоДт3);

			
				Если    ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки
					ИЛИ ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита  Тогда
					
					Проводка.СчетКт= СтруктураШапкиДокумента.СчетУчетаКорректировкиНДСКредит;
					
				Иначе
				
					Проводка.СчетКт                     = СтруктураШапкиДокумента.СчетУчетаНДС;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"   , СтруктураШапкиДокумента.ДоговорКонтрагента);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", Документы.РегистрацияВходящегоНалоговогоДокумента.ОпределитьСделкуЛокально(ЭтотОбъект));
				
				КонецЕсли;
					
			КонецЕсли;	
					
		КонецЕсли;

	КонецЦикла;
	
	ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПриобретений(СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок);
	
	ДвиженияПоРегиструНДСНалоговыйКредит( СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок);

	// с 2015 года, если дата документ и дата вх. нал. документа после 07.2015 - на налоговый кредит относятся все суммы вх. НДС, однако
	// если приобретение осуществляется для не облагаемых/не хоз. операций, необходимо оформить условную продажу
	Если    (НЕ Корректировка И ДатаВходящегоДокумента 				  >= '2015-07-01' И Дата >= '2015-07-01')
		ИЛИ (   Корректировка И ДатаКорректируемогоВходящегоДокумента >= '2015-07-01' И Дата >= '2015-07-01') Тогда
		
		Для Каждого СтрокаТаблицы Из ТаблицаДвижений Цикл
			
			Если    СтрокаТаблицы.СуммаНДСУсловнойПродажи <> 0 Тогда
				
				Проводка = ПроводкиБУ.Добавить();

				Проводка.Период                     = СтруктураШапкиДокумента.Дата;
				Проводка.Активность                 = Истина;
				Проводка.Организация                = СтруктураШапкиДокумента.Организация;
				Проводка.Сумма                      = СтрокаТаблицы.СуммаНДСУсловнойПродажи;
				Проводка.Содержание                 = НСтр("ru='Налоговый кредит по операциям не обл. НДС после 07.2015';uk='Податковий кредит за операціями не опод. ПДВ після 07.2015'", Локализация.КодЯзыкаИнформационнойБазы());
				Проводка.НомерЖурнала               = "";

					
				Проводка.СчетДт                     = СтруктураШапкиДокумента.СчетНДС;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СубконтоДт1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СубконтоДт2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СубконтоДт3);

				Проводка.СчетКт= СтруктураШапкиДокумента.СчетНДСУсловнаяПродажа;
					
			КонецЕсли;

		КонецЦикла;
		
		ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПродаж(СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок);
	
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПриобретений(СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок)

	Если  ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная 
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек 
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка Тогда
		
		// В этом случае движения по регистру НДСПокупок этом документом не формируются
		Возврат
		
	КонецЕсли;
	
	НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПриобретений;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ТаблицаДвиженийОплата 	  = ТаблицаДвижений.Скопировать();
	ТаблицаДвиженийТара 	  = ТаблицаДвижений.Скопировать();
	
	// ТОВАРЫ
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();                                                                                           
	ТаблицаКопия.Свернуть("СтавкаНДС,ДляХозяйственнойДеятельности,ВидДеятельностиНДС,ВозвратнаяТара,Амортизируется", "СуммаВал, СуммаНДСВал, СуммаНДСПропорционально");
	
	ТаблицаКопия.Колонки.СуммаВал.Имя    = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДСВал.Имя = "СуммаНДС";
	ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвижений.ЗаполнитьЗначения(Документы.РегистрацияВходящегоНалоговогоДокумента.ОпределитьСделкуЛокально(ЭтотОбъект), "Сделка");
	
	Если ВидОперации =  Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат, "СобытиеНДС");
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.КорректировкаНалоговыйДокумент, "КодОперации");
		
		// Инвертируем суммы
		Для Каждого Строка Из ТаблицаДвижений Цикл
			Строка.БазаНДС	   = -Строка.БазаНДС;
			Строка.СуммаНДС    = -Строка.СуммаНДС;
			Строка.СуммаНДСПропорционально = -Строка.СуммаНДСПропорционально;
		КонецЦикла;
		
	Иначе
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление, "СобытиеНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ПодтвержденныйНДС,  "КодОперации");
	КонецЕсли;		
	
	// ТАРА
	Если     СтруктураШапкиДокумента.СуммаВозвратнойТары <> 0 
		И НЕ ВидОперации =  Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат 
		И НЕ ВидОперации =  Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка Тогда
		
		СтрокаДвиженийПоТаре = ТаблицаДвиженийТара.Добавить();
		СтрокаДвиженийПоТаре.СтавкаНДС 						= Перечисления.СтавкиНДС.НеНДС;
		СтрокаДвиженийПоТаре.ДляХозяйственнойДеятельности 	= Истина;
		СтрокаДвиженийПоТаре.ВидДеятельностиНДС 			= Перечисления.ВидыДеятельностиНДС.Необлагаемая;
		СтрокаДвиженийПоТаре.ВозвратнаяТара 				= Истина;
		СтрокаДвиженийПоТаре.БазаНДС 						= СтруктураШапкиДокумента.СуммаВозвратнойТары;
		
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Организация       , "Организация");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Документы.РегистрацияВходящегоНалоговогоДокумента.ОпределитьСделкуЛокально(ЭтотОбъект), "Сделка");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление, "СобытиеНДС");
		ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений.ПодтвержденныйНДС,  "КодОперации");
		
	КонецЕсли; 
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьРасход();
	
	КонецЕсли;

	Если НЕ Отказ И ТаблицаДвиженийТара.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвиженийТара;
		
		Движения.ОжидаемыйИПодтвержденныйНДСПриобретений.ВыполнитьРасход();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегиструНДСНалоговыйКредит(СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок);
  		
	НаборДвижений = Движения.НДСНалоговыйКредит;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();

	ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяДекларацииНДСНалоговыйКредит", "Сумма, СуммаНДС");
	
	ТаблицаКопия.Колонки.Сумма   .Имя = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДС.Имя = "НДС";
	
	ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийНДСНалоговыйКредит.ПервичныйДокумент, "КодОперации");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.НДСНалоговыйКредит.ДобавитьДвижение();
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегиструОжидаемыйИПодтвержденныйНДСПродаж(СтруктураШапкиДокумента, ТаблицаПоТоварам,  Отказ, Заголовок)

	Если  ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная 
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек 
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка
		И ВидОперации <> Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки		Тогда
		
		// В этом случае движения по регистру НДСПокупок этом документом не формируются
		Возврат
		
	КонецЕсли;
	
	НаборДвижений = Движения.ОжидаемыйИПодтвержденныйНДСПродаж;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// ТОВАРЫ
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();                                                                                          
	Сч = 0;
	Пока Сч < ТаблицаКопия.Количество() Цикл
	
		СтрокаТоваров = ТаблицаКопия[Сч];	
		Если СтрокаТоваров.СуммаНДСУсловнойПродажи = 0 Тогда
			ТаблицаКопия.Удалить(СтрокаТоваров);                      
		Иначе
			Сч = Сч + 1;
		КонецЕсли;	
	
	КонецЦикла;
	
	ТаблицаКопия.Свернуть("СтавкаНДС", "СуммаВал, СуммаНДСУсловнойПродажи");
	
	ТаблицаКопия.Колонки.СуммаВал.Имя    			 = "БазаНДС";
	ТаблицаКопия.Колонки.СуммаНДСУсловнойПродажи.Имя = "СуммаНДС";
	
	ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	
	Если ВидОперации =  Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат Тогда
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.УсловнаяПродажаВозврат, "СобытиеНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ОжидаемыйНДС, "КодОперации");
		
		// Инвертируем суммы
		Для Каждого Строка Из ТаблицаДвижений Цикл
			Строка.БазаНДС	   = -Строка.БазаНДС;
			Строка.СуммаНДС    = -Строка.СуммаНДС;
		КонецЦикла;
		
	ИначеЕсли ВидОперации =  Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки Тогда
		
		Для каждого Строка Из ТаблицаДвижений Цикл
			
			Если Строка.БазаНДС < 0 Тогда
				Строка.БазаНДС	   = -Строка.БазаНДС;
				Строка.СуммаНДС    = -Строка.СуммаНДС;
				Строка.СобытиеНДС  = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.УсловнаяПродажаВозврат;
			Иначе	
				Строка.СобытиеНДС  = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.УсловнаяПродажа;
			КонецЕсли;
		
		КонецЦикла;
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ОжидаемыйНДС, "КодОперации");
		
	Иначе
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.УсловнаяПродажа,    "СобытиеНДС");
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ОжидаемыйНДС,  "КодОперации");
		
	КонецЕсли;		
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.ОжидаемыйИПодтвержденныйНДСПродаж.ВыполнитьПриход();
	
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента) Экспорт
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	
	СтруктураШапкиДокумента = ОбщегоНазначенияРед12.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначенияРед12.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначенияРед12.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке( ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"         , "ДоговорОрганизация");
	ОбщегоНазначенияРед12.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке( ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"         , "ВидДоговора");
	ОбщегоНазначенияРед12.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетов"                   , "ВедениеВзаиморасчетов");
	ОбщегоНазначенияРед12.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВедениеВзаиморасчетовНУ"                 , "ВедениеВзаиморасчетовНУ");
	ОбщегоНазначенияРед12.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "СложныйНалоговыйУчет"					   , "СложныйНалоговыйУчет");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

// Процедура формирует таблицы документа.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок) Экспорт
	
	// Получим необходимые данные для проведения и проверки заполенения по табличной части "Товары".
	СтруктураПолей = Новый Структура();
	СтруктураПростыхПолей = Новый Структура();
	СтруктураСложныхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("СуммаНДС"					, "СуммаНДС");
	СтруктураПолей.Вставить("ДляХозяйственнойДеятельности", "ДляХозяйственнойДеятельности");
	СтруктураПолей.Вставить("ДляОперацийОблагаемыхНДС"	, "ДляОперацийОблагаемыхНДС");
	СтруктураПолей.Вставить("Амортизируется"			, "Амортизируется");
	СтруктураПолей.Вставить("ПропорциональныйНДС"		, "ПропорциональныйНДС");
	СтруктураПолей.Вставить("СтатьяДекларацииНДСНалоговыйКредит"  	, "СтатьяДекларацииНДСНалоговыйКредит");
	СтруктураПростыхПолей.Вставить("ВозвратнаяТара"     , Ложь);
	СтруктураПолей.Вставить("СчетУчетаНДС"    	, "Ссылка.СчетУчетаНДС");
	
	РезультатЗапросаПоТоварам = ОбщегоНазначенияРед12.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураПростыхПолей, СтруктураСложныхПолей);

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	//Иначе
	//	СуммаВключаетНДС = Ложь;
	КонецЕсли;     
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Если НЕ ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда
			
			ОбособленноеПодразделение = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеОбособленноеПодразделениеОрганизации");	
			
			Если НЕ ОбособленноеПодразделение.Владелец = Организация Тогда
				ОбособленноеПодразделение = Неопределено;				
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Организация)
		И ЗначениеЗаполнено(Контрагент)
		И ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Документы.РегистрацияВходящегоНалоговогоДокумента.ЗаполнитьСчетаУчетаРасчетов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	// Заполним реквизиты из стандартного набора по документу основанию.
	ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, Основание);
 	
	ДокументОснование  = Основание;
	
	ДоговорСделка 	   = ОпределитьДоговорСделку(Основание);
	ДоговорКонтрагента = ДоговорСделка.ДоговорКонтрагента;
	Сделка 			   = ДоговорСделка.Сделка;
	
	// в случае Авансового отчета контрагент может быть переопределен
	Контрагент = ДоговорКонтрагента.Владелец;

	Если  ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаОжидаемогоИПодтвержденногоНДС")  Тогда
	  
	  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ИсправлениеОшибки;	
	  ВключаетсяВУточняющийРасчет = истина;
	  Возврат;
	  
  	ИначеЕсли  ТипЗнч(Основание) = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияЗапасов") 
	  	 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ИзменениеНалоговогоНазначенияТЗР") Тогда
	  
	  ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ВосстановлениеНалоговогоКредита;	
	  Возврат;
	  
	ИначеЕсли  ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		// возврат
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") 
			 И (НЕ  Основание.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда

		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат;
	
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РасходныйКассовыйОрдер")
		  ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		  
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")  
		 И НЕ (Основание.ВалютаДокумента = мВалютаРегламентированногоУчета) Тогда	
		
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода;
		
		Документы.РегистрацияВходящегоНалоговогоДокумента.ЗаполнитьПоРаботамОтНерезидента(ЭтотОбъект);
		// стандартного заполнения не будет.
		Возврат;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")  
		 И НЕ (Основание.ВалютаДокумента = мВалютаРегламентированногоУчета) Тогда	
		
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода;
		
		Документы.РегистрацияВходящегоНалоговогоДокумента.ЗаполнитьПоУслугамКомиссииОтНерезидента();
		// стандартнго заполнения не будет.
		Возврат;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
			 И Основание.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда

		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная;
		
		Документы.РегистрацияВходящегоНалоговогоДокумента.ЗаполнитьПоКомиссионнойТорговлеНалоговыйКодекс();
		// стандартнго заполнения не будет.
		Возврат;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
			 И Основание.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда

		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиВозврат;
		
		Документы.РегистрацияВходящегоНалоговогоДокумента.ЗаполнитьПоКомиссионнойТорговлеНалоговыйКодекс();
		// стандартнго заполнения не будет.
		Возврат;
		
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РасчетКорректировкиКорректировка;
		
		Документы.РегистрацияВходящегоНалоговогоДокумента.ЗаполнитьПоКомиссионнойТорговлеНалоговыйКодекс();
		
		Возврат	
		
	Иначе
		
		ПлательщикНДС = ЗначениеЗаполнено(Контрагент.ИНН);
		
		Если ПлательщикНДС Тогда
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная;
		Иначе
			//покупка у неплательщика НДС. Основание включения в книгу - товарний чек (п. 10.2 Порядка)
			ВидОперации = Перечисления.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек;
		КонецЕсли;
		
	КонецЕсли;
	
	Дата = Основание.Дата;
	
	ДатаВходящегоДокумента = Дата;
	
	Документы.РегистрацияВходящегоНалоговогоДокумента.ЗаполнитьПоДокументуОснованиюСУчетомОстатков(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента 	  = Товары.Итог("СуммаВзаиморасчетов");
	СуммаНДСДокумента = Товары.Итог("СуммаНДС");

	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Если ДоговорКонтрагента.ВалютаВзаиморасчетов <> мВалютаРегламентированногоУчета Тогда
			// Договор - внешнеэкономический
			СуммаВозвратнойТары = 0
		КонецЕсли;
	КонецЕсли;
	
	Если СчетНДСУсловнаяПродажа.Пустая() Тогда
		СчетНДСУсловнаяПродажа = ПланыСчетов.Хозрасчетный.УсловнаяПродажа;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначенияБП.ПолучитьРабочуюДату());
	Ответственный = Пользователи.ТекущийПользователь();
	
	ДатаПолучения = '0001-01-01';
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок, СтруктураШапкиДокумента;
	Перем ТаблицаПоТоварам;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = НСтр("ru='Проведение документа ""';uk='Проведення документа ""'") + СокрЛП(Ссылка) + """: ";

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента);
	
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
		
    ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект);

КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	СтруктураШапкиДокумента		  = Новый Структура;
	
	СтруктураШапкиДокумента.Вставить("ЕстьНДС",					 УчетнаяПолитика.ПлательщикНДС(Организация, Дата));
	СтруктураШапкиДокумента.Вставить("ВедениеВзаиморасчетовНУ",  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "ВедениеВзаиморасчетовНУ"));
	
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, МассивНепроверяемыхРеквизитов);
	
	ПроверитьЗаполнениеТабличнойЧастиТовары(СтруктураШапкиДокумента, Отказ, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецЕсли
